app/controllers/admin/products_controller.rb

  def create
    @admin_product = Admin::Product.new(admin_product_params)

    respond_to do |format|
      if @admin_product.save
---
INSERT INTO "admin_products" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", Fri, 25 Oct 2013 00:26:13 UTC +00:00], ["updated_at", Fri, 25 Oct 2013 00:26:13 UTC +00:00]]