app/controllers/logins_controller.rb

  def create
    customer = Customer.find_by(email: params[:email])
---
SELECT "customers".* FROM "customers" WHERE "customers"."email" = 'lvogely@americanpool.com' LIMIT 1

  def index
    @logins = Login.all
---
SELECT "logins".* FROM "logins"