app/controllers/password_resets_controller.rb

	def create
		customer = Customer.find_by(email: params[:email])
		if customer
			password_reset = customer.password_resets.build
			password_reset.save!
---
SELECT "customers".* FROM "customers" WHERE "customers"."email" = 'test@example.com' LIMIT 1
INSERT INTO "password_resets" ("created_at", "customer_id", "token", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Fri, 25 Oct 2013 00:50:19 UTC +00:00], ["customer_id", 411008527], ["token", "c78bb23e9141db2f8b1dac76538eea99"], ["updated_at", Fri, 25 Oct 2013 00:50:19 UTC +00:00]]