app/controllers/products_controller.rb

INSERT INTO "products" ("created_at", "name", "price", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Fri, 18 Oct 2013 01:07:34 UTC +00:00], ["name", "Lanyard"], ["price", #<BigDecimal:7fb1af483088,'0.275E1',18(18)>], ["updated_at", Fri, 18 Oct 2013 01:07:34 UTC +00:00]]
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save